test.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">\n  <Body>\n    <RetrieveRequestMsg xmlns="http://exacttarget.com/wsdl/partnerAPI">\n      <RetrieveRequest>\n        <ObjectType>BounceEvent</ObjectType>\n        <Properties>ID</Properties>\n      </RetrieveRequest>\n    </RetrieveRequestMsg>\n  </Body>\n  <Header>\n    <fueloauth xmlns="http://exacttarget.com">eyJhbGciOiJIUzI1NiIsImtpZCI6IjIiLCJ2ZXIiOiIxIiwidHlwIjoiSldUIn0.eyJhY2Nlc3NfdG9rZW4iOiJhbFVzR0VtZjl5a3A4WFp2MjF6NjE0OGgiLCJjbGllbnRfaWQiOiI1ODI0ZjR0bTF6ZG9hYjZibGt0N2ZycDkiLCJlaWQiOjEwNzcyNTk0LCJzdGFja19rZXkiOiJRQTFTMSIsInBsYXRmb3JtX3ZlcnNpb24iOjIsImNsaWVudF90eXBlIjoiU2VydmVyVG9TZXJ2ZXIifQ.__a84C03A43NhoN_M58zzJHUDs_1VuMtYk0wM2bmesg.pKA3lWUOUxdJpLXJICIgjFIt2wlfWHF5mHuli7ZlXh_Apn7oahVFwthaL73W_y_Nlf_6C9HZv0svvv3qacdg40aWCHqkOCE85xgwBCmzo5hM2Pa2a1JN5uYyuKwYW1kR-kt2QPa0KV3dviO5qboifBpknZHRqXj0SCGTcX91JIy_HwrdP</fueloauth>\n  </Header>\n</Envelope>